In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("mode.csv")

In [3]:
data.head()

   Student  Overall Marks Gender    Subject
0    Anish             97   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

In [4]:
# calculating mode of gender column

mode_data = data['Subject'].mode()
print(mode_data)

0    Chemistry
Name: Subject, dtype: object

In [5]:
#Calculating mean

mean_data = data['Overall Marks'].mean()
print (mean_data)

68.21

In [6]:
#calculating mode

mode_data = data['Overall Marks'].mode()
print (mode_data)

0    88
Name: Overall Marks, dtype: int64

In [7]:
data_new = pd.read_csv("mean_robust.csv")

In [9]:
data_new.tail()

    Student  Overall Marks  Gender    Subject
96    vivek             55    Male    Physics
97    Tisha              7  Female    English
98   Raghav             73    Male    English
99   Ishita             82  Female  Chemistry
100     NaN          10000     NaN        NaN

In [10]:
mean_data_new = data_new['Overall Marks'].mean()

In [11]:
mean_data_new

166.54455445544554

In [13]:
# for median

import pandas as pd

In [16]:
data=pd.read_csv("Median.csv")

In [17]:
data.head()

   Student  Overall Marks Gender    Subject
0    Anish           9700   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

In [18]:
#calculating median
median_data=data['Overall Marks']
print(median_data)

0     9700
1       83
2       78
3       86
4       91
      ...
95      77
96      55
97       7
98      73
99      82
Name: Overall Marks, Length: 100, dtype: int64

In [19]:
#calculating Quantiles
Q1=data['Overall Marks'].quantile(0.25)
Q2=data['Overall Marks'].quantile(0.50)
Q3=data['Overall Marks'].quantile(0.75)
Q4=data['Overall Marks'].quantile(1)

In [20]:
print('First Quantile',Q1)
print('Second Quantile',Q2)
print('Third Quantile',Q3)
print('Fourth Quantile',Q4)

First Quantile 57.25
Second Quantile 77.0
Third Quantile 87.25
Fourth Quantile 9700.0

In [1]:
# Spred of data

import pandas as pd

In [2]:
data = pd.read_csv("Spread of Data.csv")

In [3]:
data.head()

   Student  Overall Marks Gender    Subject
0    Anish           9700   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

In [4]:
max_data=data['Overall Marks'].max()

In [6]:
min_data=data['Overall Marks'].min()

In [9]:
range_data=max_data-min_data

In [10]:
print(range_data)

9700

In [11]:
# calculating quantiles 1st and 3rd quantile

Q1=data['Overall Marks'].quantile(0.25)
Q3=data['Overall Marks'].quantile(0.75)

In [12]:
IQR=Q3-Q1
print(IQR)

30.0